zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph3/PERI_MAU.h
/*
** ###################################################################
**     Processors:          MCXA173VFM
**                          MCXA173VLF
**                          MCXA173VLH
**                          MCXA173VLL
**                          MCXA174VFM
**                          MCXA174VLF
**                          MCXA174VLH
**                          MCXA174VLL
**                          MCXA343VFM
**                          MCXA343VLF
**                          MCXA343VLH
**                          MCXA343VLL
**                          MCXA344VFM
**                          MCXA344VLF
**                          MCXA344VLH
**                          MCXA344VLL
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260428
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MAU
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_MAU.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for MAU
 *
 * CMSIS Peripheral Access Layer for MAU
 */

#if !defined(PERI_MAU_H_)
#define PERI_MAU_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA173VFM) || defined(CPU_MCXA173VLF) || defined(CPU_MCXA173VLH) || defined(CPU_MCXA173VLL))
#include "MCXA173_COMMON.h"
#elif (defined(CPU_MCXA174VFM) || defined(CPU_MCXA174VLF) || defined(CPU_MCXA174VLH) || defined(CPU_MCXA174VLL))
#include "MCXA174_COMMON.h"
#elif (defined(CPU_MCXA343VFM) || defined(CPU_MCXA343VLF) || defined(CPU_MCXA343VLH) || defined(CPU_MCXA343VLL))
#include "MCXA343_COMMON.h"
#elif (defined(CPU_MCXA344VFM) || defined(CPU_MCXA344VLF) || defined(CPU_MCXA344VLH) || defined(CPU_MCXA344VLL))
#include "MCXA344_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- MAU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MAU_Peripheral_Access_Layer MAU Peripheral Access Layer
 * @{
 */

/** MAU - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[2064];
  __IO uint32_t SYS_CTLR;                          /**< System Control, offset: 0x810 */
  __IO uint32_t GEXP_STATUS_IE;                    /**< General Exception Status Interrupt Enable, offset: 0x814 */
  __IO uint32_t GEXP_STATUS;                       /**< General Exception Status, offset: 0x818 */
       uint8_t RESERVED_1[20];
  __IO uint32_t OP_CTRL;                           /**< Operation Control, offset: 0x830 */
       uint8_t RESERVED_2[4];
  __IO uint32_t RES_STATUS_IE;                     /**< Result Status Interrupt Enable, offset: 0x838 */
  __IO uint32_t RES_STATUS;                        /**< Result Status, offset: 0x83C */
  __IO uint32_t RES0;                              /**< Result Register 0, offset: 0x840 */
  __IO uint32_t RES1;                              /**< Result Register 1, offset: 0x844 */
  __IO uint32_t RES2;                              /**< Result Register 2, offset: 0x848 */
  __IO uint32_t RES3;                              /**< Result Register 3, offset: 0x84C */
} MAU_Type;

/* ----------------------------------------------------------------------------
   -- MAU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MAU_Register_Masks MAU Register Masks
 * @{
 */

/*! @name SYS_CTLR - System Control */
/*! @{ */

#define MAU_SYS_CTLR_ACG_EN_MASK                 (0x1U)
#define MAU_SYS_CTLR_ACG_EN_SHIFT                (0U)
/*! ACG_EN - Automatic Clock Gating Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_SYS_CTLR_ACG_EN(x)                   (((uint32_t)(((uint32_t)(x)) << MAU_SYS_CTLR_ACG_EN_SHIFT)) & MAU_SYS_CTLR_ACG_EN_MASK)
/*! @} */

/*! @name GEXP_STATUS_IE - General Exception Status Interrupt Enable */
/*! @{ */

#define MAU_GEXP_STATUS_IE_ERROR_IE_MASK         (0x1U)
#define MAU_GEXP_STATUS_IE_ERROR_IE_SHIFT        (0U)
/*! ERROR_IE - Direct operation Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_GEXP_STATUS_IE_ERROR_IE(x)           (((uint32_t)(((uint32_t)(x)) << MAU_GEXP_STATUS_IE_ERROR_IE_SHIFT)) & MAU_GEXP_STATUS_IE_ERROR_IE_MASK)
/*! @} */

/*! @name GEXP_STATUS - General Exception Status */
/*! @{ */

#define MAU_GEXP_STATUS_ERROR_MASK               (0x1U)
#define MAU_GEXP_STATUS_ERROR_SHIFT              (0U)
/*! ERROR - Direct operation Error
 *  0b0..No error is generated.
 *  0b1..An error is generated.
 */
#define MAU_GEXP_STATUS_ERROR(x)                 (((uint32_t)(((uint32_t)(x)) << MAU_GEXP_STATUS_ERROR_SHIFT)) & MAU_GEXP_STATUS_ERROR_MASK)
/*! @} */

/*! @name OP_CTRL - Operation Control */
/*! @{ */

#define MAU_OP_CTRL_OVDT_EN_RES0_MASK            (0x1U)
#define MAU_OP_CTRL_OVDT_EN_RES0_SHIFT           (0U)
/*! OVDT_EN_RES0 - Override RES0 Data Type Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define MAU_OP_CTRL_OVDT_EN_RES0(x)              (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_EN_RES0_SHIFT)) & MAU_OP_CTRL_OVDT_EN_RES0_MASK)

#define MAU_OP_CTRL_OVDT_RES0_MASK               (0x6U)
#define MAU_OP_CTRL_OVDT_RES0_SHIFT              (1U)
/*! OVDT_RES0 - Override RES0 Data Type
 *  0b00..UINT
 *  0b01..INT
 *  0b10..Q1.X
 *  0b11..FLOAT
 */
#define MAU_OP_CTRL_OVDT_RES0(x)                 (((uint32_t)(((uint32_t)(x)) << MAU_OP_CTRL_OVDT_RES0_SHIFT)) & MAU_OP_CTRL_OVDT_RES0_MASK)

