zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph3/PERI_MAU.h
#define MAU_RES_STATUS_RES1_UF_MASK              (0x200U)
#define MAU_RES_STATUS_RES1_UF_SHIFT             (9U)
/*! RES1_UF - RES1 IEEE Underflow Flag
 *  0b0..No tiny non-zero result is detected.
 *  0b1..A tiny non-zero result is detected.
 */
#define MAU_RES_STATUS_RES1_UF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_UF_SHIFT)) & MAU_RES_STATUS_RES1_UF_MASK)

#define MAU_RES_STATUS_RES1_OF_MASK              (0x400U)
#define MAU_RES_STATUS_RES1_OF_SHIFT             (10U)
/*! RES1_OF - RES1 IEEE Overflow Flag
 *  0b0..The result format's largest finite number is not exceeded.
 *  0b1..The result format's largest finite number is exceeded.
 */
#define MAU_RES_STATUS_RES1_OF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_OF_SHIFT)) & MAU_RES_STATUS_RES1_OF_MASK)

#define MAU_RES_STATUS_RES1_DZ_MASK              (0x800U)
#define MAU_RES_STATUS_RES1_DZ_SHIFT             (11U)
/*! RES1_DZ - RES1 IEEE Divide by Zero Flag
 *  0b0..No exact infinite result is defined for an operation on finite operands.
 *  0b1..An exact infinite result is defined for an operation on finite operands.
 */
#define MAU_RES_STATUS_RES1_DZ(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_DZ_SHIFT)) & MAU_RES_STATUS_RES1_DZ_MASK)

#define MAU_RES_STATUS_RES1_NV_MASK              (0x1000U)
#define MAU_RES_STATUS_RES1_NV_SHIFT             (12U)
/*! RES1_NV - RES1 IEEE Invalid Flag
 *  0b0..There is usefully definable result.
 *  0b1..There is no usefully definable result.
 */
#define MAU_RES_STATUS_RES1_NV(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_NV_SHIFT)) & MAU_RES_STATUS_RES1_NV_MASK)

#define MAU_RES_STATUS_RES1_ERR_MASK             (0x2000U)
#define MAU_RES_STATUS_RES1_ERR_SHIFT            (13U)
/*! RES1_ERR - RES1 Indirect Operation Error Flag
 *  0b0..No invalid indirect operation is detected.
 *  0b1..An invalid indirect operation error is detected.
 */
#define MAU_RES_STATUS_RES1_ERR(x)               (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_ERR_SHIFT)) & MAU_RES_STATUS_RES1_ERR_MASK)

#define MAU_RES_STATUS_RES1_OVWR_MASK            (0x4000U)
#define MAU_RES_STATUS_RES1_OVWR_SHIFT           (14U)
/*! RES1_OVWR - RES1 Overwrite Flag
 *  0b0..The value of RES1 has been read.
 *  0b1..The value of RES1 has not been read yet and is overwritten by a new MAUWRAP result.
 */
#define MAU_RES_STATUS_RES1_OVWR(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_OVWR_SHIFT)) & MAU_RES_STATUS_RES1_OVWR_MASK)

#define MAU_RES_STATUS_RES1_FULL_MASK            (0x8000U)
#define MAU_RES_STATUS_RES1_FULL_SHIFT           (15U)
/*! RES1_FULL - RES1 Full Flag
 *  0b0..RES1 has not updated and cannot be read.
 *  0b1..RES1 has updated and can be read.
 */
#define MAU_RES_STATUS_RES1_FULL(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES1_FULL_SHIFT)) & MAU_RES_STATUS_RES1_FULL_MASK)

#define MAU_RES_STATUS_RES2_NX_MASK              (0x10000U)
#define MAU_RES_STATUS_RES2_NX_SHIFT             (16U)
/*! RES2_NX - RES2 IEEE Inexact Flag
 *  0b0..The result is not rounded.
 *  0b1..The result is rounded, and as a result some digits lost.
 */
#define MAU_RES_STATUS_RES2_NX(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_NX_SHIFT)) & MAU_RES_STATUS_RES2_NX_MASK)

#define MAU_RES_STATUS_RES2_UF_MASK              (0x20000U)
#define MAU_RES_STATUS_RES2_UF_SHIFT             (17U)
/*! RES2_UF - RES2 IEEE Underflow Flag
 *  0b0..No tiny non-zero result is detected.
 *  0b1..A tiny non-zero result is detected.
 */
#define MAU_RES_STATUS_RES2_UF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_UF_SHIFT)) & MAU_RES_STATUS_RES2_UF_MASK)

#define MAU_RES_STATUS_RES2_OF_MASK              (0x40000U)
#define MAU_RES_STATUS_RES2_OF_SHIFT             (18U)
/*! RES2_OF - RES2 IEEE Overflow Flag
 *  0b0..The result format's largest finite number is not exceeded.
 *  0b1..The result format's largest finite number is exceeded.
 */
#define MAU_RES_STATUS_RES2_OF(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_OF_SHIFT)) & MAU_RES_STATUS_RES2_OF_MASK)

#define MAU_RES_STATUS_RES2_DZ_MASK              (0x80000U)
#define MAU_RES_STATUS_RES2_DZ_SHIFT             (19U)
/*! RES2_DZ - RES2 IEEE Divide by Zero Flag
 *  0b0..No exact infinite result is defined for an operation on finite operands.
 *  0b1..An exact infinite result is defined for an operation on finite operands.
 */
#define MAU_RES_STATUS_RES2_DZ(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_DZ_SHIFT)) & MAU_RES_STATUS_RES2_DZ_MASK)

#define MAU_RES_STATUS_RES2_NV_MASK              (0x100000U)
#define MAU_RES_STATUS_RES2_NV_SHIFT             (20U)
/*! RES2_NV - RES2 IEEE Invalid Flag
 *  0b0..There is usefully definable result.
 *  0b1..There is no usefully definable result.
 */
#define MAU_RES_STATUS_RES2_NV(x)                (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_NV_SHIFT)) & MAU_RES_STATUS_RES2_NV_MASK)

#define MAU_RES_STATUS_RES2_ERR_MASK             (0x200000U)
#define MAU_RES_STATUS_RES2_ERR_SHIFT            (21U)
/*! RES2_ERR - RES2 Indirect Operation Error Flag
 *  0b0..No invalid indirect operation is detected.
 *  0b1..An invalid indirect operation error is detected.
 */
#define MAU_RES_STATUS_RES2_ERR(x)               (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_ERR_SHIFT)) & MAU_RES_STATUS_RES2_ERR_MASK)

#define MAU_RES_STATUS_RES2_OVWR_MASK            (0x400000U)
#define MAU_RES_STATUS_RES2_OVWR_SHIFT           (22U)
/*! RES2_OVWR - RES2 Overwrite Flag
 *  0b0..The value of RES2 has been read.
 *  0b1..The value of RES2 has not been read yet and is overwritten by a new MAUWRAP result.
 */
#define MAU_RES_STATUS_RES2_OVWR(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_OVWR_SHIFT)) & MAU_RES_STATUS_RES2_OVWR_MASK)

#define MAU_RES_STATUS_RES2_FULL_MASK            (0x800000U)
#define MAU_RES_STATUS_RES2_FULL_SHIFT           (23U)
/*! RES2_FULL - RES2 Full Flag
 *  0b0..RES2 has not updated and cannot be read.
 *  0b1..RES2 has updated and can be read.
 */
#define MAU_RES_STATUS_RES2_FULL(x)              (((uint32_t)(((uint32_t)(x)) << MAU_RES_STATUS_RES2_FULL_SHIFT)) & MAU_RES_STATUS_RES2_FULL_MASK)

